Autodesk.Revit.DB.BasePoint.SharedPosition
Shared position of the BasePoint.
Since:
2019.2

Autodesk.Revit.DB.BasePoint.Position
Position of the BasePoint.
Since:
2019.2

Autodesk.Revit.DB.BasePoint.IsShared
Indicates whether the BasePoint is shared. The project's survey point
is a BasePoint which is shared.

Autodesk.Revit.DB.BasePoint
A class representing the Project Base Point and Survey Point. Each Revit project
contains one project base point and one survey point. The project base point represents the
origin of the project coordinate system. The survey point represents the origin of
the shared coordinate system.